Revit 2027 API
ViewSystemsAnalysisReport.ReportStyle Property
 The report style that specifies the display content.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SystemsAnalysisReportStyle ReportStyle { get; set; }
Public Property ReportStyle As SystemsAnalysisReportStyle
	Get
	Set
public:
property SystemsAnalysisReportStyle ReportStyle {
	SystemsAnalysisReportStyle get ();
	void set (SystemsAnalysisReportStyle value);
}
member ReportStyle : SystemsAnalysisReportStyle with get, set
Property Value
SystemsAnalysisReportStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace